package api

import (
	"net/http"
	"strings"
	"time"

	"golang.org/x/crypto/bcrypt"

	"github.com/gin-gonic/gin"
	"models"
)

type loginForm struct {
	Username string `form:"username" binding:"required"`
	Password string `form:"password" binding:"required"`
}

func login(c *gin.Context) {
	var f loginForm
	if err := c.ShouldBind(&f); err != nil {
		c.JSON(http.StatusBadRequest, gin.H{"error_msg": "اطلاعات شما کامل نیست"})
		return
	}

	var u models.User
	if err := db.Model(&models.User{}).First(&u, "username=?", f.Username).Error; err != nil {
		c.JSON(http.StatusBadRequest, gin.H{"error_msg": "اطلاعات شما کامل نیست"})
		return
	}

	if u.Status == models.UserStatusInactive {
		c.JSON(http.StatusBadRequest, gin.H{"error_msg": "کاربر مورد نظر غیر فعال است."})
		return
	}

	if err := bcrypt.CompareHashAndPassword([]byte(u.Password), []byte(f.Password)); err != nil {
		c.JSON(http.StatusBadRequest, gin.H{"error_msg": "اطلاعات شما کامل نیست"})
		return
	}

	t := time.Now()
	u.LastLogin = &t
	db.Save(&u)

	up := replaceProvince(u.Province)
	if up != "," {
		u.Province = up
	}
	token := signJWT(u)

	c.JSON(http.StatusOK, gin.H{
		"msg":   "login successfull",
		"token": token,
	})
}

func replaceProvince(cur string) string {
	for _, p := range strings.Split(cur, ",") {
		cur = cur + "," + provinceMap[p]
	}

	return cur
}

var provinceMap = map[string]string{
	"011": "281",  //"توزيع نيروي برق تبريز",
	"012": "279",  //"توزيع نيروي برق آذربايجان شرقي",
	"013": "278",  //"توزيع نيروي برق آذربايجان غربي",
	"014": "280",  //"توزيع نيروي برق اردبيل",
	"021": "797",  //"توزيع نيروي برق شهرستان اصفهان",
	"022": "796",  //"توزيع نيروي برق استان اصفهان",
	"023": "798",  //"توزيع نيروي برق چهارمحال بختياري",
	"031": "828",  //"توزيع نيروي برق استان مرکزي",
	"032": "830",  //"توزيع نيروي برق استان همدان",
	"033": "829",  //"توزيع نيروي برق استان لرستان",
	"041": "9281", //"توزيع نيروي برق تهران بزرگ",
	"042": "801",  //"توزيع نيروي برق استان تهران",
	"043": "805",  //"توزيع نيروي برق استان البرز",
	"044": "804",  //"توزيع نيروي برق استان قم",
	"051": "809",  //"توزيع نيروي برق شهرستان مشهد",
	"052": "806",  //"توزيع نيروي برق استان خراسان رضوي",
	"053": "807",  //"توزيع نيروي برق استان خراسان شمالي",
	"054": "808",  //"توزيع نيروي برق استان خراسان جنوبي",
	"061": "811",  //"توزيع نيروي برق شهرستان اهواز",
	"062": "810",  //"توزيع نيروي برق استان خوزستان",
	"063": "812",  //"توزيع نيروي برق کهکيلويه و بويراحمد",
	"071": "813",  //"توزيع نيروي برق استان زنجان",
	"072": "814",  //"توزيع نيروي برق استان قزوين",
	"081": "815",  //"توزيع نيروي برق استان سمنان",
	"091": "9541", //"توزيع نيروي برق استان سيستان و بلوچستان",
	"101": "820",  //"توزيع نيروي برق استان کرمانشاه",
	"102": "821",  //"توزيع نيروي برق استان کردستان",
	"103": "822",  //"توزيع نيروي برق استان ايلام",
	"111": "819",  //"توزيع نيروي برق شهرستان شيراز",
	"112": "817",  //"توزيع نيروي برق استان فارس",
	"113": "818",  //"توزيع نيروي برق استان بوشهر",
	"121": "824",  //"توزيع نيروي برق شمال استان کرمان",
	"122": "823",  //"توزيع نيروي برق جنوب استان کرمان",
	"131": "826",  //"توزيع نيروي برق استان گيلان",
	"141": "282",  //"توزيع نيروي برق استان مازندران",
	"142": "827",  //"توزيع نيروي برق غرب استان مازندران",
	"143": "825",  //"توزيع نيروي برق استان گلستان",
	"151": "831",  //"توزيع نيروي برق استان هرمزگان",
	"161": "832",  //"توزيع نيروي برق استان يزد",
}
