package exporttavanir

import "sort"

func getSortedCompanies() []string {
	keys := make([]string, 0, len(companies))
	for k := range companies {
		keys = append(keys, k)
	}
	sort.Strings(keys)
	return keys
}

var companies = map[string]string{
	"011": "توزیع نیروی برق تبریز",
	"012": "توزیع نیروی برق آذربایجان شرقی",
	"013": "توزیع نیروی برق آذربایجان غربی",
	"014": "توزیع نیروی برق اردبیل",
	"021": "توزیع نیروی برق شهرستان اصفهان",
	"022": "توزیع نیروی برق استان اصفهان",
	"023": "توزیع نیروی برق چهارمحال بختیاری",
	"031": "توزیع نیروی برق استان مرکزی",
	"032": "توزیع نیروی برق استان همدان",
	"033": "توزیع نیروی برق استان لرستان",
	"041": "توزیع نیروی برق تهران بزرگ",
	"042": "توزیع نیروی برق استان تهران -نواحی ",
	"043": "توزیع نیروی برق استان البرز",
	"044": "توزیع نیروی برق استان قم",
	"051": "توزیع نیروی برق شهرستان مشهد",
	"052": "توزیع نیروی برق استان خراسان رضوی",
	"053": "توزیع نیروی برق استان خراسان شمالی",
	"054": "توزیع نیروی برق استان خراسان جنوبی",
	"061": "توزیع نیروی برق شهرستان اهواز",
	"062": "توزیع نیروی برق استان خوزستان",
	"063": "توزیع نیروی برق کهکیلویه و بویراحمد",
	"071": "توزیع نیروی برق استان زنجان",
	"072": "توزیع نیروی برق استان قزوین",
	"081": "توزیع نیروی برق استان سمنان",
	"091": "توزیع نیروی برق استان سیستان و بلوچستان",
	"101": "توزیع نیروی برق استان کرمانشاه",
	"102": "توزیع نیروی برق استان کردستان",
	"103": "توزیع نیروی برق استان ایلام",
	"111": "توزیع نیروی برق شهرستان شیراز",
	"112": "توزیع نیروی برق استان فارس",
	"113": "توزیع نیروی برق استان بوشهر",
	"121": "توزیع نیروی برق شمال استان کرمان",
	"122": "توزیع نیروی برق جنوب استان کرمان",
	"131": "توزیع نیروی برق استان گیلان",
	"141": "توزیع نیروی برق استان مازندران",
	"142": "توزیع نیروی برق غرب استان مازندران",
	"143": "توزیع نیروی برق استان گلستان",
	"151": "توزیع نیروی برق استان هرمزگان",
	"161": "توزیع نیروی برق استان یزد",
}
